import img from '../../../styles/Csharp_Logo.png';

const csharp = {
    image: img,
    langName: 'C#',
    information: [
        "C# е универсален, подходящ за разработка на уеб, настолни и мобилни приложения и игри.",
        "Активна общност, богати ресурси, библиотеки и рамки.",
        "Кросплатформена разработка с .NET Core/.NET 7+.",
        "Visual Studio предоставя мощна среда за разработка.",
        "Силна поддръжка на обектно-ориентирано програмиране (ООП).",
        "Изчерпателна стандартна библиотека за общи задачи.",
        "Запитването, интегрирано в езика, опростява манипулирането на данни.",
        "Изобилни перспективи за работа в различни роли, свързани с разработването на софтуер.",
        "Често се използва за разработване на игри с Unity."
    ],
    photoStyle: {
        width: '500px', /* Set the desired width */
    }
}

export default csharp