import img from '../../../styles/photos/csharpLogoNew.png';

const csharp = {
    image: img,
    langName: 'C#',
    information: [
        "C# е универсален, подходящ за разработка на уеб, настолни и мобилни приложения и игри.",
        "Visual Studio предоставя мощна среда за разработка.",
        "Силна поддръжка на обектно-ориентирано програмиране (ООП).",
        "Изчерпателна стандартна библиотека за общи задачи.",
        "Запитването, интегрирано в езика, опростява манипулирането на данни.",
        "Изобилни перспективи за работа в различни роли, свързани с разработването на софтуер.",
    ],
    photoStyle: {
        width: '400px',
        height: '400px' /* Set the desired width */
    }
}

export default csharp