import img from '../../../styles/csharp1.png';

const csharp = {
    image: img,
    langName: 'C#',
    information: [
        " C# е универсален, подходящ за разработка на уеб, настолни и мобилни приложения и игри.",
        " Visual Studio предоставя мощна среда за разработка.",
        " Силна поддръжка на обектно-ориентирано програмиране (ООП).",
        " Изчерпателна стандартна библиотека за общи задачи.",
        " Запитването, интегрирано в езика, опростява манипулирането на данни.",
        " Изобилни перспективи за работа в различни роли, свързани с разработването на софтуер.",
    ],

}

export default csharp