import img from '../../../styles/java-logo.png';

const java = {
    image: img,
    langName: 'Java',
    information: [
        " Java е универсална, използва се в уеб, настолни, мобилни и корпоративни приложения.",
        " Вградените функции за сигурност повишават сигурността на приложенията.",
        " Широко разпространен за изграждане на приложения на корпоративно ниво.",
        " Уменията за работа с Java отварят врати към широк спектър от възможности за работа.",
        " Изобилие от онлайн форуми и ресурси за обучение и отстраняване на проблеми.",
    ],
}

export default java