import img from '../../../styles/java-logo.webp';

const java = {
    image: img,
    langName: 'Java',
    information: [
        "Java е универсална, използва се в уеб, настолни, мобилни и корпоративни приложения.",
        "Голяма и активна Java общност, която предоставя обширни ресурси и библиотеки.",
        "Вградените функции за сигурност повишават сигурността на приложенията.",
        "Широко разпространен за изграждане на приложения на корпоративно ниво.",
        "Java се използва за разработване на приложения за Android.",
        "Уменията за работа с Java отварят врати към широк спектър от възможности за работа.",
        "Изобилие от онлайн форуми и ресурси за обучение и отстраняване на проблеми.",
    ],
    photoStyle: {
        width: '300px', /* Set the desired width */
        height: '450px'/* Set the desired height */
    }
}

export default java