const cppQuestions = [
    {
        question: 'Какво представлява програмният език C++ и къде се използва?',
        answer: 'C++ е програмен език с висока производителност, използван за разработка на софтуер, включително системни приложения, игри и вградени системи.'
    },
    {
        question: 'Какво е указател в C++ и как се използва?',
        answer: 'Указателите в C++ са променливи, които съдържат адреси към паметта. Те се използват за работа с динамично заделяне на памет и манипулация с данни в паметта.'
    },
    {
        question: 'Как се използва наследяването в C++ и какво е виртуална функция?',
        answer: 'Наследяването в C++ позволява създаването на нов клас, наречен "потомък", базиран на съществуващ клас, наречен "родител". Виртуалните функции позволяват динамично полиморфизъм и предоставят гъвкавост при работа с обекти от различни класове.'
    },
    // Add more C++ questions and answers here.
];

export default cppQuestions