
const csharp = [
    {
        question: 'Защо да уча C# и .NET?',
        answer: 'Ученето на C# и .NET предоставя възможност за разработка на разнообразни приложения, включително уеб, десктоп, мобилни и игрови. Тези технологии са широко използвани и предоставят множество възможности за кариера.'
    },
    {
        question: 'Какво прави езикът C# подходящ за начинаещи?',
        answer: 'C# е структурен и лесен за научаване език. Той предлага строга типизация и богат екосистем, което прави разработката по-прозрачна и подходяща за новачки.'
    },
    {
        question: 'Какво представлява програмният език C#?',
        answer: 'C# е програмен език, който е разработен в Microsoft от Андерс Хейлсберг през 2000 г. Характерно за него е, че е структурен, мулти-парадигмен, строго-типизиран, декларативен, императивен, функционален, обектно-ориентиран, компонентно-ориентиран програмен език с общо предназначение.'
    },
    {
        question: 'Какви са основните предимства на платформата .NET?',
        answer: 'Платформата .NET предоставя интегрирано средство за разработка и изпълнение на софтуер, което включва богата стандартна библиотека, средства за сигурност и инструменти за управление на изключенията.'
    },
    {
        question: 'Какво представлява асинхронното програмиране в C#?',
        answer: 'Асинхронното програмиране в C# позволява на приложенията да изпълняват неблокиращи операции и да останат отзивчиви. Това е полезно за работа с мрежови операции и вход/изход.'
    },
    {
        question: 'Как се работи с бази данни в C#?',
        answer: 'В C# могат да се използват различни библиотеки и технологии за работа с бази данни. Една от популярните е Entity Framework, който улеснява ORM и работата с бази данни.'
    },
];


export default csharp;
