const jsQuestions = [
    {
        question: 'Какво е JavaScript и какво е неговото предназначение?',
        answer: 'JavaScript е високо-нивен, интерпретируем, многопарадигмен програмен език, използван за добавяне на интерактивност и динамичност към уеб страниците.'
    },
    {
        question: 'Какво представлява обектно-ориентираното програмиране (ООП) в JavaScript?',
        answer: 'Обектно-ориентираното програмиране в JavaScript позволява създаването на обекти със свойства и методи, което облеснява организацията и модулността на кода.'
    },
    {
        question: 'Какво е асинхронното програмиране в JavaScript и защо е важно?',
        answer: 'Асинхронното програмиране в JavaScript позволява изпълнението на неблокиращи операции, като заявки към сървъри или обработка на събития. Това поддържа отзивчиви уеб приложения.'
    },
    // Add more JavaScript questions and answers here.
];

export default jsQuestions;