import img from '../../../styles/java-logo.webp';

const javaQuestions = [
    {
        question: 'Какво представлява програмният език Java и как се използва?',
        answer: 'Java е обектно-ориентиран програмен език, използван за създаване на разнообразни приложения, включително уеб, десктоп, мобилни и сървърни приложения.'
    },
    {
        question: 'Какви са основните принципи на обектно-ориентираното програмиране (ООП) в Java?',
        answer: 'Основните принципи на ООП в Java включват инкапсулация, наследяване и полиморфизъм, които помагат за създаване на модулен и поддръжаем код.'
    },
    {
        question: 'Как се управляват изключенията в Java и защо е важно?',
        answer: 'Управлението на изключенията в Java позволява на програмистите да се справят с грешки и изключения по контролиран начин, което подобрява стабилността на програмата.'
    },
    // Add more Java questions and answers here.
];
export default javaQuestions