const sqlQuestions = [
    {
        question: 'Какво представлява SQL и за какво се използва?',
        answer: 'SQL (Structured Query Language) е език за управление на релационни бази данни. Той се използва за създаване, модифициране и извличане на данни от бази данни.'
    },
    {
        question: 'Как се създава нова таблица в база данни с SQL?',
        answer: 'За да създадете нова таблица в база данни, използвайте SQL командата "CREATE TABLE". Тази команда определя структурата на таблицата, включително имената на колоните и типовете им данни.'
    },
    {
        question: 'Какво представлява SQL заявката "SELECT" и как се използва?',
        answer: 'SQL заявката "SELECT" се използва за извличане на данни от една или повече таблиците в базата данни. Тя позволява филтриране, сортиране и групиране на данните според нуждите на потребителя.'
    },
    {
        question: 'Как се извършва обновление на данни с SQL?',
        answer: 'За обновление на данни в база данни се използва SQL заявката "UPDATE". Тази заявка променя стойностите на определени редове или колони в таблицата.'
    },
    // Add more SQL questions and answers here.
];

export default sqlQuestions