// data.js
import courseCover from '../../../styles/photos/big-banner.png'
import mentorshipCover from '../../../styles/photos/mentorshipBanner.png'

import video from '../../../styles/videos/ад-02.mp4';

const products = [
    // {
    //     id: 1,
    //     title: "Майсторство със C# за начинаещи - Наръчник",
    //     description: "Въвеждащ наръчник по програмиране със C#, обхващащ основни концепции и практически приложения за начинаещи. С този наръчник ще научите - как да създадете вашето първо приложение, как да използвате важни нещата, като методи и масиви, как да правите проверки и още много други неща.",
    //     price: 17.00,
    //     skills: [
    //         "Променливи",
    //         "Четене и писане в конзолата",
    //         "Проверки на кода с If-Else и Switch",
    //         "Цикли For и While",
    //         "Методи",
    //         "Масиви"
    //     ],
    //     categories: [
    //         "Програмиране",
    //         "Разработване на софтуер",
    //         "Образователни",
    //         "Начинаещи със C#"
    //     ],
    //     bookCover: bookCover,

    // },
    // {
    //     id: 2,
    //     cover: courseCover,
    //     video: video,
    //     title: 'Първи стъпки в програмирането: Създаване на първия проект от нулата',
    //     description: "Присъединете се към нашия 3-седмичен курс по C# за начинаещи, за да научите основните принципи на програмирането. Включва онлайн лекции, електронна книга, упражнения, подкрепа от общността и сертификат за ученици с успех 4.50 или повече.",
    //     price: '197.00 лв.',
    //     oldPrice: '597.00 лв.',
    //     skills: [
    //         "Променливи",
    //         "Четене и писане в конзолата",
    //         "Проверки на кода с If-Else и Switch",
    //         "Цикли For и While",
    //         "Методи",
    //         "Масиви"
    //     ],
    //     categories: [
    //         "Програмиране",
    //         "Разработване на софтуер",
    //         "Образователни",
    //         "Начинаещи със C#"
    //     ],
    // },
    {
        id: 4,
        cover: mentorshipCover,
        video: video,
        title: 'Mенторска програма на Whiz Academy',
        description: 'Единствената менторска програма в България с персонализирано менторство от топ експерти. Нашите индивидуални сесии обхващат програмиране, реални проекти и кариерни съвети, предоставяйки уникален учебен опит. Идеално за ученици, студенти и хора, които искат да сменят кариерата си. Започни с нас и стани част от единствената такава общност в страната.',
        price: '27.00 лв.',
        oldPrice: '297.00 лв.',
        skills: [
            "Променливи",
            "Четене и писане в конзолата",
            "Проверки на кода с If-Else и Switch",
            "Цикли For и While",
            "Методи",
            "Масиви"
        ],
        categories: [
            "Програмиране",
            "Разработване на софтуер",
            "Образователни",
            "Начинаещи със C#"
        ],
    },
];

export default products;
