// data.js
import bookCover from '../../../styles/photos/bookCover.png'
import courseCover from '../../../styles/photos/course-banner.png'

const products = [
    {
        id: 1,
        title: "Майсторство със C# за начинаещи - Наръчник",
        description: "Въвеждащ наръчник по програмиране със C#, обхващащ основни концепции и практически приложения за начинаещи. С този наръчник ще научите - как да създадете вашето първо приложение, как да използвате важни нещата, като методи и масиви, как да правите проверки и още много други неща.",
        price: 17.00,
        skills: [
            "Променливи",
            "Четене и писане в конзолата",
            "Проверки на кода с If-Else и Switch",
            "Цикли For и While",
            "Методи",
            "Масиви"
        ],
        categories: [
            "Програмиране",
            "Разработване на софтуер",
            "Образователни",
            "Начинаещи със C#"
        ],
        bookCover: bookCover,

    },
    {
        id: 2,
        bookCover: courseCover,
        title: 'Напиши първото си приложение със C# - само за 3 седмици',
        description: "Въвеждащ наръчник по програмиране със C#, обхващащ основни концепции и практически приложения за начинаещи. С този наръчник ще научите - как да създадете вашето първо приложение, как да използвате важни нещата, като методи и масиви, как да правите проверки и още много други неща.",
        price: 17.00,
        skills: [
            "Променливи",
            "Четене и писане в конзолата",
            "Проверки на кода с If-Else и Switch",
            "Цикли For и While",
            "Методи",
            "Масиви"
        ],
        categories: [
            "Програмиране",
            "Разработване на софтуер",
            "Образователни",
            "Начинаещи със C#"
        ],
    },
    {
        id: 3,
        bookCover: 'cover3.jpg',
        title: 'Fancy Product 3',
        priceRange: '$60.00 - $100.00'
    }
];

export default products;
