const questionsDb = [
    {
        id: 1,
        title: 'Каква е нашата мисия?',
        description: (
            <div>
                Мисията ни в WhizTech е да Ви предоставим висококачествени, индивидуални уроци по програмиране, които отговарят на
                уникалните учебни нужди на всеки.<br />
                Посветени сме на това да насърчим страстта към кодирането и да помогнем на
                нашите студенти да развият практически умения, които ще им послужат добре в академичния и професионалния им път.
            </div>)

    }, {
        id: 2,
        title: 'Защо да изберете нас?',
        description: (
            <div>
                Изберете ни за вашето пътуване в областта на кодирането. <br />
                <strong>Експертни инструктори:</strong> Нашите програмисти от реалния свят предоставят индивидуални напътствия, съобразени с вас. <br />
                <strong> Персонализирано обучение:</strong>  Персонализираните уроци отговарят на вашите уникални нужди, ускорявайки напредъка ви в кодирането. <br />
                <strong>Интерактивни уроци:</strong>  Увлекателните практически упражнения превръщат обучението по програмиране в истинска забава. <br />
                <strong>Гъвкаво планиране:</strong>  Учете в удобно за вас време - ден, вечер или уикенд. Вашето пътуване, вашият начин.
            </div>
        )

    }, {
        id: 3,
        title: 'Как преминава обучението?',
        description: (
            <div>
                <strong>Оценка:</strong> Оценяваме вашите умения и цели.  <br />
                <strong>Индивидуална учебна програма:</strong> Създаваме персонализиран план за обучение. <br />
                <strong>Кодиране "един на един":</strong> Експертни инструктори ви напътстват индивидуално. <br />
                <strong>Интерактивно обучение:</strong> Практическо кодиране и предизвикателства. <br />
                <strong>Гъвкав график:</strong> Учете в удобно за вас време. <br />
                <strong>Постоянна подкрепа:</strong> Получете помощ по всяко време, когато имате нужда от нея. <br />
                Ние правим кодирането лесно и съобразено с вас!
            </div>
        )
    }]

export default questionsDb;