const questionsDb = [
    {
        id: 1,
        title: 'Каква е нашата мисия?',
        description: (
            <div>
                Нашата мисия в Whiz Academy е да предоставим висококачествени, персонализирани уроци по програмиране, съобразени с индивидуалните нужди на всеки студент. Стремим се да вдъхновим страст към кодирането и да подпомогнем нашите студенти в развиването на практически умения, ценни за тяхната подготовка и професионална кариера. Целта ни е да направим пътя към успешна ИТ кариера достъпен, удовлетворяващ и по-бърз за всеки.
            </div>)

    }, {
        id: 3,
        title: 'Как преминава обучението?',
        description: (
            <div>
                <strong>Индивидуална учебна програма:</strong> Персонализиран план, съобразен с вашите цели и ниво на опит. <br />
                <strong>Кодиране "един на един":</strong>  Индивидуални насоки от експертни инструктори.<br />
                <strong>Интерактивно обучение:</strong> Практическо кодиране и предизвикателства за ангажиращо обучение. <br />
                <strong>Гъвкав график:</strong> Учете в удобно за вас време – денем, вечер или през уикендите. <br />
                <strong>Постоянна подкрепа:</strong>Винаги на разположение за помощ. <br />
                Ние правим кодирането лесно, забавно и персонализирано за вас!
            </div>

        )



    }, {
        id: 2,
        title: 'Защо да изберете нас?',
        description: (
            <div>
                Изберете Whiz Academy за вашето пътуване в света на кодирането. <br />
                <strong>Експертни инструктори:</strong>  Опитни програмисти предоставят индивидуални напътствия. <br />
                <strong>Персонализирано обучение:</strong>  Адаптирани уроци за ускорено развитие. <br />
                <strong>Интерактивни уроци:</strong> Забавни и практически упражнения. <br />
                <strong>Гъвкаво планиране:</strong> Учете в удобно за вас време – денем, вечер или през уикендите. Вашето обучение, вашият график.
            </div>
        )
    }]

export default questionsDb;