const questionsDb = [
    {
        id: 1,
        title: 'Каква е нашата мисия?',
        description: (
            <div>
                Мисията ни в Whiz Academy е да предоставим висококачествени, персонализирани уроци по програмиране,
                съобразени с индивидуалните нужди на всеки студент.
                Стремим се да вдъхновим страст към кодирането и да подпомогнем нашите студенти в развиването на практически умения,
                които ще бъдат ценни, както в подготовка им, така и в професионалната им кариера.
                <br></br>Нашата цел е да направим пътя към успешната ИТ кариера достъпен, удовлетворяващ и по-бърз за всеки.
            </div>)

    }, {
        id: 3,
        title: 'Как преминава обучението?',
        description: (
            <div>
                <strong>Индивидуална учебна програма:</strong> Разработваме персонализиран план за обучение, съобразен с вашите цели и ниво на опит. <br />
                <strong>Кодиране "един на един":</strong> Нашите експертни инструктори ви напътстват индивидуално, предоставяйки насоки и подкрепа. <br />
                <strong>Интерактивно обучение:</strong> Участвате в практическо кодиране и предизвикателства, които правят обучението интересно и ангажиращо. <br />
                <strong>Гъвкав график:</strong> Учете в удобно за вас време – денем, вечер или през уикендите. <br />
                <strong>Постоянна подкрепа:</strong> Винаги може да разчитате на помощ, когато имате нужда от нея. <br />
                Ние правим кодирането лесно, забавно и персонализирано за вас!
            </div>

        )



    }, {
        id: 2,
        title: 'Защо да изберете нас?',
        description: (
            <div>
                Изберете Whiz Academy за вашето пътуване в света на кодирането. <br />
                <strong>Експертни инструктори:</strong> Нашите опитни програмисти предоставят индивидуални напътствия, съобразени с вашите нужди и цели. <br />
                <strong>Персонализирано обучение:</strong> Индивидуалните уроци са адаптирани към вашите уникални изисквания, което ускорява вашето развитие в програмирането. <br />
                <strong>Интерактивни уроци:</strong> Забавни и практически упражнения правят обучението по програмиране интересно и ангажиращо. <br />
                <strong>Гъвкаво планиране:</strong> Учете в удобно за вас време – денем, вечер или през уикендите. Вашето обучение, вашият график.
            </div>
        )
    }]

export default questionsDb;