// csharpExercises.js

const csharpExercises = [
    {
        id: 1,
        question: 'Напишете програма, която прочита от конзолата име, години и град и печата следното съобщение: Моето име е {име}, на {години} и съм от град {град}.',
        firstInput: 'Георги Петров 19 София',
        secondInput: 'Александра Иванова 31 Пловдив',

        answers: [
            'Моето име е Георги Петров, на 19 и съм от град София.',
            'Моето име е Александра Иванова, на 31 и съм от град Пловдив.'

        ]
    },
    {
        id: 2,
        question: "Напишете програма, която пресмята нужните разходи за закупуването на храна за котки. Една опавка котешка храна е 3лв. Прочетете колко опавки ще се закупят и изпишете крайната сума, която трябва да се плати.",
        firstInput: '6',
        secondInput: '15',

        answers: [
            '18',
            '45'
        ]
    },
    {
        id: 3,
        question: "Да се напише конзолна програма, която чете оценка (дробно число), въведена от потребителя и отпечатва 'Отличен!', ако оценката е 5.50 или по-висока.",
        firstInput: '6',
        secondInput: '3.50',

        answers: [
            'Отличен!',
            'Няма изход!'
        ]

    },
    {
        id: 4,
        question: "Напишете програма, която извежда всички четни числа от 1 до 20.",
        firstInput: 'Тази задача не изисква вход!',
        secondInput: '',
        answers: [
            '2, 4, 6, 8, 10, 12, 14, 16, 18, 20',
        ]
    },
    {
        id: 6,
        question: "Напишете програма, която приема число от потребителя и извежда таблица с умножение на това число от 1 до 10.",
        firstInput: '5',
        secondInput: '',
        answers: [
            '5 x 1 = 5, 5 x 2 = 10, 5 x 3 = 15  ... 5 x 10 = 50',
        ]
    },
    {
        id: 7,
        question: "Напишете програма, която намира сумата на всички нечетни числа от 1 до 100, използвайки цикъл 'while'.",
        firstInput: 'Тази задача не изисква вход!',
        secondInput: '',
        answers: [
            '2500',
        ]
    },
    {
        id: 8,
        question: "Напишете метод, който приема два аргумента (числа) и връща тяхното средно аритметично.",
        firstInput: '5 7',
        secondInput: '10 21',
        answers: [
            '6',
            '15.5'
        ]
    },
    {
        id: 10,
        question: "Напишете програма, която приема масив от числа и извежда средното им аритметично.",
        firstInput: '1, 2, 3, 4, 5',
        secondInput: '10, 15, 7, 3',
        answers: [
            'Средното аритметично на числата [1, 2, 3, 4, 5] е 3.',
            'Средното аритметично на числата [10, 15, 7, 3] е 8,75.',

        ]
    },
    {
        id: 11,
        question: "Напишете програма, която приема масив от числа и намира най-големия елемент в него.",
        firstInput: '12, 5, 27, 8, 19',
        secondInput: '754, 12, 64, 1, 52',
        answers: [
            'Най-големият елемент в масива [12, 5, 27, 8, 19] е 27.',
            'Най-големият елемент в масива [754, 12, 64, 1, 52] е 754.'
        ]
    },
    {
        id: 12,
        question: "Създайте клас 'Person' със свойства за име, възраст и адрес. Напишете конструктор за този клас и метод за извеждане на информацията за човека.",
        firstInput: 'Тази задача не изисква вход!',
        answers: [
            'Име: Иван, Възраст: 30, Адрес: София',
        ]
    },
    {
        id: 14,
        question: "Напишете програма, която проверява дали дадено число е положително, отрицателно. Потребителят въвежда число, и програмата извежда подходящо съобщение.",
        firstInput: '5',
        secondInput: '-3',
        answers: [
            'Числото е положително.',
            'Числото е отрицателно.',
        ]
    },
    {
        id: 16,
        question: "Напишете програма, която приема число и проверява дали то е четно и също така дели се на 3. Потребителят въвежда число, и програмата извежда подходящо съобщение.",
        firstInput: '6',
        secondInput: '9',
        answers: [
            'Числото е четно и се дели на 3.',
            'Числото не е четно и не се дели на 3.',
        ]
    },
    {
        id: 19,
        question: "Напишете програма, която приема число от потребителя и извежда всички делители на това число.",
        firstInput: '12',
        secondInput: '17',
        answers: [
            'Делителите на числото 12 са: 1, 2, 3, 4, 6, 12.',
            'Делителите на числото 17 са: 1, 17.',
        ]
    },
    {
        id: 20,
        question: "Напишете метод, който приема низ и връща броя на буквите в него.",
        firstInput: 'programming',
        secondInput: 'programming',
        answers: [
            'Броят на буквите в низа "programming" е 11.',
        ]
    }
];

export default csharpExercises;
